* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
/** New Program WORK-P1.
/**
/** :author Administrator
/* TODO Enter your code here
DEFINE DATA LOCAL
1 CRUISE VIEW OF SAG-TOURS-E-CRUISE
  2 START-HARBOR
  2 START-DATE
  2 DESTINATION-HARBOR
  2 END-DATE
END-DEFINE
*
READ CRUISE BY START-HARBOR STARTING FROM 'A'
  DISPLAY  START-HARBOR START-DATE DESTINATION-HARBOR END-DATE
END-READ
*
END
